app/controllers/attendances_controller.rb

    def set_attendance
      @attendance = Attendance.find(params[:id])
---
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", 1]]