app/controllers/coaches_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
    def find_event
        @event = Event.find(params[:event_id])