app/controllers/events_controller.rb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = ?  [["event_id", 1]]
UPDATE "attendances" SET "has_attended" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["has_attended", "f"], ["updated_at", "2016-04-03 09:40:37.469284"], ["id", 1]]
---
  def update_attendance
    attended_hash = params[:attendance]
    @event.attendances.each do |attendance|
      has_attended = attended_hash.key?(attendance.id.to_s)
      if has_attended != attendance.has_attended
        if has_attended
          attendance.update(has_attended: true)