app/controllers/users_controller.rb

  def sign_in
    user = User.find_by_name(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "Apple"]]